Revit 2027 API
Parameter.SetValueString Method
Set the parameter value according to the input string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SetValueString(
	string valueString
)
Public Function SetValueString (
	valueString As String
) As Boolean
public:
bool SetValueString(
	String^ valueString
)
member SetValueString :
        valueString : string -> bool
Parameters
valueString String
The string that represents the parameter value.
Return Value
Boolean
Indicates whether the parameter value is successfully set.
Remarks
The method only applies to parameters of value types.
Example
public bool SetWithValueString(Parameter foundParameter)
{
    bool result = false;
    if (!foundParameter.IsReadOnly)
    {
        //If successful, the result is true
        result = foundParameter.SetValueString("-22\'3\"");
    }
    return result;
}
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace